tutorials/eulerVortex.enforced/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7606
(
(0.799976 0.199994 0)
(0.799976 0.199994 0)
(0.799976 0.199994 0)
(0.799976 0.199994 0)
(0.799976 0.199994 0)
(0.799976 0.199994 0)
(0.799976 0.199994 0)
(0.799976 0.199994 0)
...
)
;

boundaryField
{
    emptyPatches_empt
    {
        type            fixedValue;
        value           uniform (0.8944 0.4472 0);
    }
    top_cyc
    {
        type            fixedValue;
        value           uniform (0.8944 0.4472 0);
    }
    bottom_cyc
    {
        type            fixedValue;
        value           uniform (0.8944 0.4472 0);
    }
    inlet_cyc
    {
        type            fixedValue;
        value           uniform (0.8944 0.4472 0);
    }
    outlet_cyc
    {
        type            fixedValue;
        value           uniform (0.8944 0.4472 0);
    }
}


// ************************************************************************* //
